export const courseList = {
  kids: [
    {
      name: 'PRO MATH + PRO ENG + PRO THAI',
      specialTime: true,
      time: 'เลือกวันเรียนได้ (คอร์ส A - คอร์ส E)',
      grade: 'ระดับชั้น ป.1 / ป.2 / ป.3 / ป.4',
      subject: 'คณิตศาสตร์ หรือ ภาษาอังกฤษ หรือ ภาษาไทย (เลือกได้มากที่สุด 2 วิชา/คอร์ส)',
      price: 1200
    },
    {
      name: 'PRO MATH',
      time: 'เรียน 2 วัน/สัปดาห์ (ไม่จำกัดชั่วโมงเรียน)',
      grade: 'ระดับชั้น ป.5',
      subject: 'คณิตศาสตร์',
      price: 1200
    },
    {
      name: 'PRO ENG',
      time: 'เรียน 1 วัน/สัปดาห์ (วันละ 2 ชั่วโมงครึ่ง)',
      grade: 'ระดับชั้น ป.5',
      subject: 'ภาษาอังกฤษ',
      price: 1200
    },
    {
      name: 'PRO SCI',
      time: 'เรียน 1 วัน/สัปดาห์ (วันละ 2 ชั่วโมงครึ่ง)',
      grade: 'ระดับชั้น ป.5',
      subject: 'วิทยาศาสตร์',
      price: 1200
    },
  ],
  prePro: [
    {
      name: 'PRE PRO 1',
      description: 'คอร์สปรับพื้นฐาน',
      time: 'เรียน 2 วัน/สัปดาห์',
      grade: 'ระดับชั้น ป.6',
      price: 2222,
      remarks: [
        'วิชาคณิตศาสตร์จะมีชั่วโมงเรียนไม่เท่ากัน ตามทักษะของนักเรียน',
        'จะมีการทดสอบในทุกสัปดาห์ และ แจ้งคะแนนให้ผู้ปกครอง'
      ],
      subject: [
        {
          name: 'คณิตศาสตร์',
          time: 'ไม่จำกัดชั่วโมงเรียน'
        },
        {
          name: 'ภาษาอังกฤษ',
          time: 'เรียนวันละ 3 ชั่วโมง'
        },
      ]
    },
    {
      name: 'PRE PRO 2',
      description: 'คอร์สวิทย์ ติวสอบเข้าโครงการพิเศษ Gifted, โรงเรียนสาธิตชื่อดัง',
      time: 'เรียน 1 วัน/สัปดาห์',
      grade: 'ระดับชั้น ป.6',
      price: 1299,
      remarks: [
        'สามารถซื้อคอร์สเพิ่ม เพื่อเพิ่มชั่วโมงเรียนได้ตามต้องการ'
      ],
      subject: [
        {
          name: 'ฟิสิกส์ + เคมี + ชีวะ (พื้นฐาน)',
          time: 'เรียนวันละ 3 ชั่วโมง'
        },
      ]
    },
    {
      name: 'PRE PRO 3',
      description: 'คอร์สทบทวนเนื้อหา + ตะลุยโจทย์ข้อสอบเก่า',
      time: 'เรียน 2-3 วัน/สัปดาห์',
      grade: 'ระดับชั้น ป.6',
      price: '2,999 บาท/เดือน (วิชาละ 1,000 บาท/เดือน)',
      remarks: [
        'เรียนรวมทั้ง 6 วิชา ตามตารางเรียนแต่ละสัปดาห์',
        'อาจมีการเพิ่มวันเรียน โดยไม่เสียค่าใช้จ่ายเพิ่ม',
      ],
      subject: [
        {
          name: 'คณิตศาสตร์',
          time: 'เรียนตามตารางเรียน'
        },
        {
          name: 'วิทยาศาสตร์',
          time: 'เรียนตามตารางเรียน'
        },
        {
          name: 'ภาษาอังกฤษ',
          time: 'เรียนตามตารางเรียน'
        },
        {
          name: 'ภาษาไทย',
          time: 'เรียนตามตารางเรียน'
        },
        {
          name: 'สังคมศึกษา',
          time: 'เรียนตามตารางเรียน'
        },
        {
          name: 'มิติสัมพันธ์ และ การคิดแบบมีเหตุผล',
          time: 'เรียนตามตารางเรียน'
        },
      ]
    }
  ],
  teen: [
    {
      name: 'PRO MATH',
      subject: 'คณิตศาสตร์',
      time: 'เรียน 2 วัน/สัปดาห์ (ไม่จำกัดชั่วโมงเรียน)',
      grade: [
        {
          name: 'มัธยมศึกษาปีที่ 1',
          price: 1150
        },
        {
          name: 'มัธยมศึกษาปีที่ 2',
          price: 1250
        },
        {
          name: 'มัธยมศึกษาปีที่ 3',
          price: 1350
        }
      ]
    },
    {
      name: 'PRO SCI',
      subject: 'วิทยาศาสตร์',
      time: 'เรียน 1 วัน/สัปดาห์ (วันละ 3 ชั่วโมง)',
      grade: [
        {
          name: 'มัธยมศึกษาปีที่ 1',
          price: 1100
        },
        {
          name: 'มัธยมศึกษาปีที่ 2',
          price: 1200
        },
        {
          name: 'มัธยมศึกษาปีที่ 3',
          price: 1300
        }
      ]
    },
    {
      name: 'PRO ENG',
      subject: 'ภาษาอังกฤษ',
      time: 'เรียน 1 วัน/สัปดาห์ (วันละ 2 ชั่วโมงครึ่ง)',
      grade: [
        {
          name: 'มัธยมศึกษาปีที่ 1',
          price: 1200
        },
        {
          name: 'มัธยมศึกษาปีที่ 2',
          price: 1300
        },
        {
          name: 'มัธยมศึกษาปีที่ 3',
          price: 1400
        }
      ]
    },
    {
      subject: 'คณิตศาสตร์ + วิทยาศาสตร์',
      name: 'เตรียมติวเข้า ม.4 (3,241 บาท/เดือน)',
      time: 'เรียนตามตารางติว (เริ่มสอน ม.ค.-มี.ค.)',
      special: true,
      grade: [
        {
          name: 'คณิตศาสตร์*',
          time: '2 วัน/สัปดาห์ (วันละ 3-4 ชั่วโมง)',
          price: 3241
        },
        {
          name: 'วิทยาศาสตร์',
          time: '1 วัน/สัปดาห์ (วันละ 3 ชั่วโมง)',
          price: 3241
        },
      ]
    }
  ],
  high: [
    {
      name: 'PRO MATH BY KPPM',
      subject: 'คณิตศาสตร์',
      time: 'เรียน 2 วัน/สัปดาห์ (ไม่จำกัดชั่วโมงเรียน)',
      grade: [
        {
          name: 'มัธยมศึกษาปีที่ 4',
          price: 1450
        },
        {
          name: 'มัธยมศึกษาปีที่ 5',
          price: 1550
        },
      ]
    },
    {
      name: 'PRO PHY, PRO CHEM, PRO BIO',
      subject: 'ฟิสิกส์, เคมี, ชีวะ',
      time: 'เรียน 1 วัน/สัปดาห์ (วันละ 3 ชั่วโมง)',
      grade: [
        {
          name: 'มัธยมศึกษาปีที่ 4',
          price: 1400
        },
        {
          name: 'มัธยมศึกษาปีที่ 5',
          price: 1450
        },
      ]
    },
    {
      name: 'PRO ENG',
      subject: 'ภาษาอังกฤษ',
      time: 'เรียน 1 วัน/สัปดาห์ (วันละ 3 ชั่วโมงครึ่ง)',
      grade: [
        {
          name: 'SECONDARY 1',
          price: 1500
        },
        {
          name: 'SECONDARY 2',
          price: 1550
        },
        {
          name: 'SECONDARY 3',
          price: 1600
        }
      ]
    },
  ],
  tgat: [
    {
      name: 'TGAT 1',
      subject: 'การสื่อสารภาษาอังกฤษ',
      desc: [
        'ทักษะการพูด ทักษะการอ่าน',
        'ปูพื้นฐานแกรมมาร์เพื่อเสริมความมั่นใจ'
      ]
    },
    {
      name: 'TGAT 2',
      subject: 'การคิดอย่างมีเหตุผล',
      desc: [
        'ความสามารถทางภาษา',
        'ความสามารถทางตัวเลข',
        'ความสามารถทางมิติสัมพันธ์',
        'ความสามารถทางเหตุผล'
      ]
    },
    {
      name: 'TGAT 3',
      subject: 'สมรรถนะการทำงาน',
      desc: [
        'การสร้างคุณค่า และ นวัตกรรม',
        'การแก้ไขปัญหาที่ซับซ้อน',
        'การบริหารจัดการอารมณ์',
        'การเป็นพลเมืองที่มีส่วนรวมทางสังคม',
      ]
    },
  ],
  tcas: [
    {
      name: 'PRO MATH TCAS (1,689 บาท/เดือน)',
      subject: 'A-LEVEL คณิตศาสตร์ประยุกต์ 1-2',
      time: 'อังคาร, พุธ (17:00 - ทำเสร็จ)',
      desc: [
        'ติวเนื้อหา สรุป คณิต อย่างเข้มข้น มัธยมศึกษาชั้นปีที่ 4-6',
        'เทคนิคทางลัดกวาดคะแนน พร้อมตะลุยโจทย์',
        'โจทย์หลักสูตรแนวใหม่ โจทย์สามัญข้อสอบเก่า'
      ].join(' '),
    },
    {
      name: 'PRO ENG TCAS (1,619 บาท/เดือน)',
      subject: 'A-LEVEL ภาษาอังกฤษ',
      time: 'พุธ (17:00 - 20:30)',
      desc: [
        'สรุปโค้งสุดท้าย ทบทวนเนื้อหา',
        'Listening, Speaking, Reading & Writing',
        'ตะลุยโจทย์สามัญข้อสอบเก่า'
      ].join(' '),
    },
    {
      name: 'PRO PHY TCAS (1,595 บาท/เดือน)',
      subject: 'A-LEVEL ฟิสิกส์',
      time: 'พฤหัส (15:30 - 19:00)',
      desc: [
        'ติวเนื้อหา สรุป ฟิสิกส์ อย่างเข้มข้น มัธยมศึกษาชั้นปีที่ 4-6',
        'เทคนิค แนวทางข้อสอบ พร้อมตะลุยโจทย์',
        'โจทย์หลักสูตรแนวใหม่ โจทย์สามัญข้อสอบเก่า'
      ].join(' '),
    },
    {
      name: 'PRO CHEM TCAS (1,565 บาท/เดือน)',
      subject: 'A-LEVEL เคมี',
      time: 'เสาร์ (12:30 - 15:30)',
      desc: [
        'ติวเนื้อหา สรุป เคมี อย่างเข้มข้น มัธยมศึกษาชั้นปีที่ 4-6',
        'เทคนิค แนวทางข้อสอบ พร้อมตะลุยโจทย์',
        'โจทย์หลักสูตรแนวใหม่ โจทย์สามัญข้อสอบเก่า'
      ].join(' '),
    }
  ]
}